outputs/qwen36-35b-a3b-fp8_pro5000_8x72g_input-4k-output-1k_cand32_baseline/results/c018/bench_c56_20260831-021019.log
$ python -m sglang.bench_serving --backend sglang --dataset-name random-ids --random-range-ratio 1.0 --host 127.0.0.1 --port 30001 --model /data/autotune/models/Qwen3.6-35B-A3B-FP8 --dataset-path '' --max-concurrency 56 --random-input-len 4096 --random-output-len 1024 --output-file /workspace/outputs/c018/bench_c56_20260831-021019.jsonl --num-prompts 224
# exit code: 0

----- stdout -----
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30001, ready_check_timeout_sec=60, dataset_name='random-ids', dataset_path='', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='/data/autotune/models/Qwen3.6-35B-A3B-FP8', served_model_name=None, tokenizer=None, num_prompts=224, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=4096, random_output_len=1024, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=56, output_file='/workspace/outputs/c018/bench_c56_20260831-021019.jsonl', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:30001/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30001, ready_check_timeout_sec=60, dataset_name='random-ids', dataset_path='', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='/data/autotune/models/Qwen3.6-35B-A3B-FP8', served_model_name=None, tokenizer=None, num_prompts=224, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=4096, random_output_len=1024, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=56, output_file='/workspace/outputs/c018/bench_c56_20260831-021019.jsonl', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 917504
#Output tokens: 229376
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 56        
Successful requests:                     224       
Benchmark duration (s):                  80.73     
Total input tokens:                      917504    
Total input text tokens:                 917504    
Total generated tokens:                  229376    
Total generated tokens (retokenized):    224386    
Request throughput (req/s):              2.77      
Input token throughput (tok/s):          11365.51  
Output token throughput (tok/s):         2841.38   
Peak output token throughput (tok/s):    4649.00   
Peak concurrent requests:                67        
Total token throughput (tok/s):          14206.88  
Concurrency:                             53.09     
Accept length:                           3.61      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   19131.76  
Median E2E Latency (ms):                 17979.53  
P90 E2E Latency (ms):                    23828.84  
P95 E2E Latency (ms):                    25588.19  
P99 E2E Latency (ms):                    32527.81  
---------------Time to First Token----------------
Mean TTFT (ms):                          3633.12   
Median TTFT (ms):                        2437.09   
P90 TTFT (ms):                           5842.40   
P95 TTFT (ms):                           8161.24   
P99 TTFT (ms):                           16587.82  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          15.15     
Median TPOT (ms):                        14.80     
P90 TPOT (ms):                           19.16     
P95 TPOT (ms):                           20.14     
P99 TPOT (ms):                           21.08     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           15.22     
Median ITL (ms):                         9.61      
P90 ITL (ms):                            37.77     
P95 ITL (ms):                            40.55     
P99 ITL (ms):                            73.98     
Max ITL (ms):                            4898.19   
==================================================

----- stderr -----
/sgl-workspace/sglang/python/sglang/bench_serving.py:13: FutureWarning: `sglang.bench_serving` is deprecated and will be removed in a future release; use `sglang.benchmark.serving` instead (e.g. `python -m sglang.benchmark.serving`).
  warnings.warn(

  0%|          | 0/224 [00:00<?, ?it/s]
  0%|          | 1/224 [00:15<56:58, 15.33s/it]
  2%|▏         | 5/224 [00:15<08:32,  2.34s/it]
  5%|▌         | 12/224 [00:16<02:49,  1.25it/s]
  6%|▋         | 14/224 [00:17<02:36,  1.34it/s]
  8%|▊         | 17/224 [00:17<01:49,  1.89it/s]
  8%|▊         | 19/224 [00:17<01:28,  2.30it/s]
  9%|▉         | 21/224 [00:18<01:22,  2.48it/s]
 10%|▉         | 22/224 [00:18<01:20,  2.51it/s]
 10%|█         | 23/224 [00:18<01:14,  2.71it/s]
 11%|█         | 24/224 [00:19<01:13,  2.73it/s]
 11%|█         | 25/224 [00:19<01:07,  2.97it/s]
 12%|█▏        | 26/224 [00:20<01:17,  2.57it/s]
 12%|█▏        | 27/224 [00:20<01:08,  2.86it/s]
 12%|█▎        | 28/224 [00:20<01:08,  2.85it/s]
 13%|█▎        | 29/224 [00:20<01:04,  3.03it/s]
 14%|█▍        | 31/224 [00:21<00:52,  3.68it/s]
 15%|█▍        | 33/224 [00:21<00:38,  4.92it/s]
 15%|█▌        | 34/224 [00:21<00:45,  4.15it/s]
 16%|█▌        | 35/224 [00:22<00:48,  3.87it/s]
 17%|█▋        | 37/224 [00:22<00:45,  4.08it/s]
 17%|█▋        | 38/224 [00:22<00:45,  4.11it/s]
 18%|█▊        | 40/224 [00:23<00:42,  4.37it/s]
 18%|█▊        | 41/224 [00:23<00:42,  4.29it/s]
 20%|█▉        | 44/224 [00:23<00:29,  6.06it/s]
 20%|██        | 45/224 [00:24<00:36,  4.88it/s]
 21%|██        | 46/224 [00:24<00:51,  3.43it/s]
 21%|██        | 47/224 [00:25<01:22,  2.15it/s]
 21%|██▏       | 48/224 [00:31<04:52,  1.66s/it]
 22%|██▏       | 50/224 [00:31<02:56,  1.01s/it]
 23%|██▎       | 52/224 [00:31<01:57,  1.47it/s]
 24%|██▎       | 53/224 [00:31<01:46,  1.61it/s]
 25%|██▍       | 55/224 [00:32<01:11,  2.36it/s]
 25%|██▌       | 56/224 [00:32<01:08,  2.46it/s]
 26%|██▌       | 58/224 [00:32<00:53,  3.13it/s]
 27%|██▋       | 61/224 [00:33<00:45,  3.57it/s]
 28%|██▊       | 62/224 [00:33<00:47,  3.41it/s]
 28%|██▊       | 63/224 [00:34<00:50,  3.20it/s]
 29%|██▊       | 64/224 [00:34<00:49,  3.26it/s]
 29%|██▉       | 66/224 [00:34<00:35,  4.45it/s]
 30%|██▉       | 67/224 [00:34<00:36,  4.36it/s]
 30%|███       | 68/224 [00:35<00:34,  4.52it/s]
 31%|███       | 69/224 [00:35<00:47,  3.25it/s]
 31%|███▏      | 70/224 [00:35<00:44,  3.43it/s]
 32%|███▏      | 72/224 [00:36<00:34,  4.43it/s]
 33%|███▎      | 73/224 [00:36<00:37,  3.98it/s]
 33%|███▎      | 74/224 [00:36<00:37,  4.05it/s]
 33%|███▎      | 75/224 [00:37<00:40,  3.64it/s]
 34%|███▍      | 76/224 [00:37<00:39,  3.74it/s]
 34%|███▍      | 77/224 [00:37<00:36,  4.07it/s]
 35%|███▍      | 78/224 [00:37<00:32,  4.53it/s]
 35%|███▌      | 79/224 [00:37<00:31,  4.62it/s]
 36%|███▌      | 80/224 [00:38<00:32,  4.49it/s]
 36%|███▌      | 81/224 [00:38<00:34,  4.20it/s]
 38%|███▊      | 84/224 [00:38<00:25,  5.54it/s]
 38%|███▊      | 85/224 [00:39<00:31,  4.45it/s]
 38%|███▊      | 86/224 [00:39<00:30,  4.56it/s]
 39%|███▉      | 87/224 [00:39<00:30,  4.44it/s]
 39%|███▉      | 88/224 [00:40<00:36,  3.69it/s]
 40%|███▉      | 89/224 [00:40<00:35,  3.82it/s]
 41%|████      | 91/224 [00:41<01:02,  2.14it/s]
 41%|████      | 92/224 [00:42<01:02,  2.13it/s]
 42%|████▏     | 93/224 [00:42<01:02,  2.09it/s]
 42%|████▏     | 94/224 [00:43<00:52,  2.49it/s]
 42%|████▏     | 95/224 [00:45<01:52,  1.14it/s]
 43%|████▎     | 96/224 [00:47<02:28,  1.16s/it]
 43%|████▎     | 97/224 [00:47<01:55,  1.10it/s]
 44%|████▍     | 99/224 [00:47<01:13,  1.71it/s]
 45%|████▌     | 101/224 [00:48<00:58,  2.11it/s]
 46%|████▌     | 102/224 [00:48<00:52,  2.33it/s]
 46%|████▋     | 104/224 [00:49<00:51,  2.32it/s]
 47%|████▋     | 106/224 [00:49<00:38,  3.06it/s]
 48%|████▊     | 107/224 [00:50<00:41,  2.81it/s]
 48%|████▊     | 108/224 [00:50<00:36,  3.14it/s]
 49%|████▊     | 109/224 [00:50<00:35,  3.22it/s]
 49%|████▉     | 110/224 [00:50<00:31,  3.58it/s]
 50%|████▉     | 111/224 [00:51<00:33,  3.40it/s]
 50%|█████     | 113/224 [00:51<00:31,  3.48it/s]
 51%|█████     | 114/224 [00:52<00:32,  3.37it/s]
 51%|█████▏    | 115/224 [00:52<00:29,  3.70it/s]
 52%|█████▏    | 116/224 [00:52<00:25,  4.16it/s]
 52%|█████▏    | 117/224 [00:52<00:23,  4.57it/s]
 53%|█████▎    | 118/224 [00:52<00:23,  4.43it/s]
 54%|█████▎    | 120/224 [00:53<00:24,  4.25it/s]
 54%|█████▍    | 121/224 [00:53<00:24,  4.25it/s]
 55%|█████▍    | 123/224 [00:53<00:22,  4.51it/s]
 56%|█████▋    | 126/224 [00:54<00:21,  4.63it/s]
 57%|█████▋    | 128/224 [00:54<00:17,  5.59it/s]
 58%|█████▊    | 129/224 [00:55<00:19,  4.87it/s]
 58%|█████▊    | 130/224 [00:55<00:29,  3.19it/s]
 58%|█████▊    | 131/224 [00:56<00:33,  2.74it/s]
 59%|█████▉    | 132/224 [00:56<00:31,  2.91it/s]
 60%|█████▉    | 134/224 [00:57<00:28,  3.17it/s]
 60%|██████    | 135/224 [00:57<00:25,  3.45it/s]
 61%|██████    | 136/224 [00:57<00:23,  3.72it/s]
 61%|██████    | 137/224 [00:57<00:25,  3.45it/s]
 62%|██████▏   | 138/224 [00:58<00:31,  2.70it/s]
 62%|██████▏   | 139/224 [00:59<00:44,  1.91it/s]
 62%|██████▎   | 140/224 [01:00<00:52,  1.60it/s]
 63%|██████▎   | 141/224 [01:00<00:47,  1.76it/s]
 63%|██████▎   | 142/224 [01:01<00:45,  1.82it/s]
 64%|██████▍   | 143/224 [01:01<00:46,  1.72it/s]
 64%|██████▍   | 144/224 [01:03<01:02,  1.28it/s]
 65%|██████▍   | 145/224 [01:03<00:47,  1.65it/s]
 65%|██████▌   | 146/224 [01:04<00:56,  1.38it/s]
 66%|██████▌   | 147/224 [01:04<00:45,  1.68it/s]
 67%|██████▋   | 149/224 [01:05<00:31,  2.37it/s]
 67%|██████▋   | 150/224 [01:05<00:30,  2.45it/s]
 67%|██████▋   | 151/224 [01:05<00:27,  2.61it/s]
 68%|██████▊   | 153/224 [01:06<00:23,  3.08it/s]
 69%|██████▉   | 154/224 [01:06<00:24,  2.87it/s]
 69%|██████▉   | 155/224 [01:06<00:21,  3.21it/s]
 70%|██████▉   | 156/224 [01:07<00:18,  3.68it/s]
 70%|███████   | 157/224 [01:07<00:17,  3.84it/s]
 71%|███████   | 158/224 [01:07<00:17,  3.79it/s]
 71%|███████   | 159/224 [01:07<00:19,  3.30it/s]
 72%|███████▏  | 161/224 [01:08<00:13,  4.78it/s]
 72%|███████▏  | 162/224 [01:08<00:14,  4.22it/s]
 73%|███████▎  | 164/224 [01:08<00:10,  5.59it/s]
 74%|███████▍  | 166/224 [01:09<00:10,  5.32it/s]
 76%|███████▌  | 170/224 [01:09<00:09,  5.45it/s]
 76%|███████▋  | 171/224 [01:10<00:11,  4.73it/s]
 77%|███████▋  | 173/224 [01:10<00:11,  4.53it/s]
 78%|███████▊  | 174/224 [01:11<00:13,  3.65it/s]
 78%|███████▊  | 175/224 [01:11<00:15,  3.12it/s]
 79%|███████▉  | 177/224 [01:12<00:12,  3.63it/s]
 80%|███████▉  | 179/224 [01:12<00:11,  4.06it/s]
 81%|████████▏ | 182/224 [01:12<00:07,  5.46it/s]
 82%|████████▏ | 183/224 [01:12<00:06,  5.86it/s]
 82%|████████▏ | 184/224 [01:14<00:15,  2.57it/s]
 83%|████████▎ | 186/224 [01:14<00:12,  2.98it/s]
 83%|████████▎ | 187/224 [01:14<00:12,  3.04it/s]
 84%|████████▍ | 188/224 [01:15<00:12,  2.95it/s]
 84%|████████▍ | 189/224 [01:15<00:12,  2.75it/s]
 85%|████████▍ | 190/224 [01:15<00:10,  3.38it/s]
 85%|████████▌ | 191/224 [01:15<00:08,  3.96it/s]
 86%|████████▌ | 192/224 [01:17<00:15,  2.04it/s]
 86%|████████▌ | 193/224 [01:17<00:15,  2.06it/s]
 87%|████████▋ | 195/224 [01:17<00:09,  2.95it/s]
 88%|████████▊ | 197/224 [01:18<00:06,  4.00it/s]
 88%|████████▊ | 198/224 [01:18<00:06,  4.21it/s]
 89%|████████▉ | 199/224 [01:18<00:06,  4.10it/s]
 89%|████████▉ | 200/224 [01:18<00:05,  4.00it/s]
 90%|████████▉ | 201/224 [01:19<00:05,  3.89it/s]
 91%|█████████ | 203/224 [01:19<00:03,  5.96it/s]
 92%|█████████▏| 207/224 [01:19<00:01, 11.02it/s]
 93%|█████████▎| 209/224 [01:19<00:01, 12.44it/s]
 95%|█████████▍| 212/224 [01:19<00:00, 14.47it/s]
 96%|█████████▌| 214/224 [01:19<00:00, 10.05it/s]
 96%|█████████▋| 216/224 [01:20<00:00, 10.28it/s]
 97%|█████████▋| 218/224 [01:20<00:00, 10.61it/s]
 98%|█████████▊| 220/224 [01:20<00:00, 10.07it/s]
 99%|█████████▉| 222/224 [01:20<00:00, 11.16it/s]
100%|██████████| 224/224 [01:20<00:00,  2.78it/s]